Repository: Aubind97/php-validator
Catalog: locale/*/messages.po
Languages: fr_fr

# betweenLength
source: %s must have a length between %d and %d characters
fr_fr: %s doit faire entre %d et %d caractères

# datetime
source: %s must be a date with the format %s
fr_fr: %s doit être une date au format %s

# email
source: %s must be a valid email
fr_fr: %s doit être un email valide

# empty
source: %s could not be empty
fr_fr: %s ne peut être vide

# exists
source: %s should exists in %s table
fr_fr: %s doit exister dans la table %s

# filetype
source: %s must be a file with the following extensions %s
fr_fr: %s doit être un fichier avec l'extension %s

# maxLength
source: %s must be shorter than %d characters
fr_fr: %s doit faire moins de %d caractères

# minLength
source: %s must be longer than %d characters
fr_fr: %s doit faire plus de %d caractères

# money
source: %s must be money format
fr_fr: %s doit être au format monnaie

# numeric
source: %s must be a number
fr_fr: %s doit être un nombre

# required
source: %s is required
fr_fr: %s est requis

# slug
source: %s must be a slug
fr_fr: %s doit être un slug

# unique
source: %s should be unique but %s is already used
fr_fr: %s doit être unique mais %s est déjà utilisé

# uploaded
source: %s must contain a file
fr_fr: %s doit contenir un fichier
